
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/yuita-yoshihiko/aws-ecs-terraform/actions/runs/5828046646)



<pre><code>Apply complete! Resources: 7 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
data.aws_iam_policy_document.ecs_assume: Reading...
aws_ecr_repository.ecr_repository: Refreshing state... [id=go-simple-server]
data.aws_iam_policy_document.ecs_task_assume: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-06b8f27414d1cabf8]
data.aws_iam_policy_document.ecs_assume: Read complete after 0s [id=1077804475]
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=1077804475]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=go-simple-server]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0f0f5a7e5cce06140]
aws_security_group.ecs: Refreshing state... [id=sg-09dad8cc25e0acaa1]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0480925e51e99cc7a]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-010c2c0524b144700]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-08194cb55181a78fe]
aws_security_group.alb: Refreshing state... [id=sg-0a9d386fe1969d674]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-07392b2be2d18bf9c]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0a8087efaf3b54d8d]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b80ac677bb33214f]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:469112528302:targetgroup/go-simple-server-target-group/625447b11a80fc4c]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0edd855a902645cb0]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0f92484e7b5c3bc3d]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0a7f1b532514522c6]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-00f719498d88461c4]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-3202176488]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0e0b546d722c0f501]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0cef5de48e279d15c]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0daa3d3bd23fdf220]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0a33747bcbdddeb0b]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-00f719498d88461c41080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-04f73d7f394b158f8]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01957416a0ca6bf21]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:469112528302:loadbalancer/app/go-simple-server-alb/dc64aee3ed3d3134]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-022cca83687a69979]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-070a6a32772284545]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0480925e51e99cc7a1080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-08194cb55181a78fe1080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:469112528302:listener/app/go-simple-server-alb/dc64aee3ed3d3134/652045111d449a67]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:469112528302:listener-rule/app/go-simple-server-alb/dc64aee3ed3d3134/652045111d449a67/335a8907ba45f676]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cloudwatch_log_group will be created
  + resource "aws_cloudwatch_log_group" "cloudwatch_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/go-simple-server"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "go-simple-server"
      + tags_all = (known after apply)
    }

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "go-simple-server"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "go-simple-server"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:469112528302:targetgroup/go-simple-server-target-group/625447b11a80fc4c"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-09dad8cc25e0acaa1",
            ]
          + subnets          = [
              + "subnet-010c2c0524b144700",
              + "subnet-0b80ac677bb33214f",
            ]
        }
    }

  # aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "HEALTH_CHECK_PATH"
                          + value = "/health_checks"
                        },
                      + {
                          + name  = "NGINX_PORT"
                          + value = "8080"
                        },
                    ]
                  + image            = "medpeer/health_check:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/go-simple-server"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "go-simple-server"
                        }
                    }
                  + name             = "go-simple-server"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "go-simple-server"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
    }

  # aws_iam_role.ecs will be created
  + resource "aws_iam_role" "ecs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_basic will be created
  + resource "aws_iam_role_policy_attachment" "ecs_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "go-simple-server-ecs"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
aws_ecs_cluster.ecs_cluster: Creating...
aws_iam_role.ecs_task: Creating...
aws_cloudwatch_log_group.cloudwatch_log_group: Creating...
aws_iam_role.ecs: Creating...
aws_iam_role.ecs: Creation complete after 0s [id=go-simple-server-ecs]
aws_iam_role.ecs_task: Creation complete after 0s [id=go-simple-server-ecs-task]
aws_iam_role_policy_attachment.ecs_basic: Creating...
aws_iam_role_policy_attachment.ecs_basic: Creation complete after 1s [id=go-simple-server-ecs-20230811015024571100000001]
aws_cloudwatch_log_group.cloudwatch_log_group: Creation complete after 2s [id=/aws/ecs/go-simple-server]
aws_ecs_task_definition.ecs_task_definition: Creating...
aws_ecs_task_definition.ecs_task_definition: Creation complete after 0s [id=go-simple-server]
aws_ecs_cluster.ecs_cluster: Still creating... [10s elapsed]
aws_ecs_cluster.ecs_cluster: Creation complete after 12s [id=arn:aws:ecs:ap-northeast-1:469112528302:cluster/go-simple-server]
aws_ecs_service.ecs_service: Creating...
aws_ecs_service.ecs_service: Creation complete after 3s [id=arn:aws:ecs:ap-northeast-1:469112528302:service/go-simple-server/go-simple-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":6,"Program":"tfcmt","SHA1":"cb84f079261c529e3a9538e07565b6931ed3f367","Vars":{},"WorkflowName":"Terraform"} -->